# A191 Stock Factors 101-120

In [1]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [2]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 101

Formula:

`((RANK(CORR(CLOSE, SUM(MEAN(VOLUME,30), 37), 15)) < RANK(CORR(RANK(((HIGH * 0.1) + (VWAP * 0.9))),RANK(VOLUME), 11))) * -1)`

In [3]:
sql_alpha_101 = f"""--sql
SELECT
    date,
    instrument,
    IF(((c_pct_rank(m_corr(close, m_sum(m_avg(volume,30), 37), 15)) <
         c_pct_rank(m_corr(c_pct_rank(((high * 0.1) + (vwap * 0.9))),c_pct_rank(volume), 11)))),1,0) * -1 
    AS alpha_a191_f0101
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_101), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0101
5067    2023-01-04  000001.SZ               0.0
5068    2023-01-04  000002.SZ               0.0
5069    2023-01-04  000004.SZ               0.0
5070    2023-01-04  000005.SZ               0.0
5071    2023-01-04  000006.SZ               0.0
...            ...        ...               ...
3858343 2025-12-26  688805.SH               0.0
3858344 2025-12-26  688807.SH               0.0
3858345 2025-12-26  688819.SH              -1.0
3858346 2025-12-26  688981.SH              -1.0
3858347 2025-12-26  689009.SH               0.0

[3668803 rows x 3 columns]

## A191 Factor 102

Formula:

`SMA(MAX(VOLUME-DELAY(VOLUME,1),0),6,1)/SMA(ABS(VOLUME-DELAY(VOLUME,1)),6,1)*100`

In [4]:
sql_alpha_102 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(greatest(volume-m_lag(volume,1),0),6,1) /
    m_ta_ewm(abs(volume-m_lag(volume,1)),6,1) * 100 
    AS alpha_a191_f0102
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_102), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0102
10134   2023-01-05  000001.SZ          0.000000
10135   2023-01-05  000002.SZ          0.000000
10136   2023-01-05  000004.SZ          0.000000
10137   2023-01-05  000005.SZ         16.666667
10138   2023-01-05  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.000000
3858344 2025-12-26  688807.SH         13.240103
3858345 2025-12-26  688819.SH         55.704260
3858346 2025-12-26  688981.SH         46.498931
3858347 2025-12-26  689009.SH         68.763093

[3663499 rows x 3 columns]

## A191 Factor 103

Formula:

`((20-LOWDAY(LOW,20))/20)*100`

In [5]:
sql_alpha_103 = f"""--sql
SELECT
    date,
    instrument,
    ((20-m_imin(low,20))/20)*100 
    AS alpha_a191_f0103
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_103), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0103
101438  2023-02-07  000001.SZ             100.0
101439  2023-02-07  000002.SZ              10.0
101440  2023-02-07  000004.SZ              70.0
101441  2023-02-07  000005.SZ              35.0
101442  2023-02-07  000006.SZ              45.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH              80.0
3858341 2025-12-26  688800.SH              85.0
3858345 2025-12-26  688819.SH              85.0
3858346 2025-12-26  688981.SH              40.0
3858347 2025-12-26  689009.SH              65.0

[3568164 rows x 3 columns]

## A191 Factor 104

Formula:

`(-1 * (DELTA(CORR(HIGH, VOLUME, 5), 5) * RANK(STD(CLOSE, 20))))`

In [6]:
sql_alpha_104 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * (m_delta(m_corr(high, volume, 5), 5) * c_pct_rank(m_stddev(close, 20)))) 
    AS alpha_a191_f0104
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_104), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0104
101438  2023-02-07  000001.SZ          0.240717
101439  2023-02-07  000002.SZ          1.230255
101440  2023-02-07  000004.SZ          0.128728
101441  2023-02-07  000005.SZ         -0.107175
101442  2023-02-07  000006.SZ          0.027240
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.192432
3858341 2025-12-26  688800.SH         -0.317175
3858345 2025-12-26  688819.SH          0.130048
3858346 2025-12-26  688981.SH          0.315414
3858347 2025-12-26  689009.SH          0.557557

[3567582 rows x 3 columns]

## A191 Factor 105

Formula:

`(-1 * CORR(RANK(OPEN), RANK(VOLUME), 10))`

In [7]:
sql_alpha_105 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_corr(c_pct_rank(open), c_pct_rank(volume), 10)) 
    AS alpha_a191_f0105
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_105), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0105
50681   2023-01-17  000001.SZ          0.349183
50682   2023-01-17  000002.SZ         -0.034019
50683   2023-01-17  000004.SZ         -0.593282
50684   2023-01-17  000005.SZ         -0.635621
50685   2023-01-17  000006.SZ         -0.874303
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.256867
3858341 2025-12-26  688800.SH         -0.144507
3858345 2025-12-26  688819.SH         -0.242968
3858346 2025-12-26  688981.SH         -0.529853
3858347 2025-12-26  689009.SH          0.238831

[3620504 rows x 3 columns]

## A191 Factor 106

Formula:

`CLOSE-DELAY(CLOSE,20)`

In [8]:
sql_alpha_106 = f"""--sql
SELECT
    date,
    instrument,
    close-m_lag(close,20) 
    AS alpha_a191_f0106
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_106), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0106
106518  2023-02-08  000001.SZ        -31.902139
106519  2023-02-08  000002.SZ       -271.333712
106520  2023-02-08  000004.SZ          1.381713
106521  2023-02-08  000005.SZ         -0.463380
106522  2023-02-08  000006.SZ        -26.868288
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.680903
3858341 2025-12-26  688800.SH         32.804327
3858345 2025-12-26  688819.SH          2.077693
3858346 2025-12-26  688981.SH          8.500000
3858347 2025-12-26  689009.SH         -0.041330

[3562874 rows x 3 columns]

## A191 Factor 107

Formula:

`(((-1 * RANK((OPEN -DELAY(HIGH, 1)))) * RANK((OPEN -DELAY(CLOSE, 1)))) *RANK((OPEN -DELAY(LOW, 1))))`

In [9]:
sql_alpha_107 = f"""--sql
SELECT
    date,
    instrument,
    (((-1 * c_pct_rank((open -m_lag(high, 1)))) *
      c_pct_rank((open -m_lag(close, 1)))) *
      c_pct_rank((open -m_lag(low, 1)))) 
    AS alpha_a191_f0107
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_107), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0107
10134   2023-01-05  000001.SZ         -0.113657
10135   2023-01-05  000002.SZ         -0.000002
10136   2023-01-05  000004.SZ         -0.042623
10137   2023-01-05  000005.SZ         -0.292534
10138   2023-01-05  000006.SZ         -0.000188
...            ...        ...               ...
3858343 2025-12-26  688805.SH         -0.009285
3858344 2025-12-26  688807.SH         -0.000002
3858345 2025-12-26  688819.SH         -0.166646
3858346 2025-12-26  688981.SH         -0.000134
3858347 2025-12-26  689009.SH         -0.067318

[3663499 rows x 3 columns]

## A191 Factor 108

Formula:

`((RANK((HIGH -MIN(HIGH, 2)))^RANK(CORR((VWAP), (MEAN(VOLUME,120)), 6))) * -1)`

In [10]:
sql_alpha_108 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank((high - m_min(high, 2)))^c_pct_rank(m_corr((vwap), (m_avg(volume,120)), 6))) * -1) 
    AS alpha_a191_f0108
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_108), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0108
642811  2023-07-12  000001.SZ         -0.995030
642812  2023-07-12  000002.SZ         -0.380525
642814  2023-07-12  000005.SZ         -0.924527
642815  2023-07-12  000006.SZ         -0.539860
642817  2023-07-12  000008.SZ         -0.473626
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.623875
3858341 2025-12-26  688800.SH         -0.417636
3858345 2025-12-26  688819.SH         -0.871649
3858346 2025-12-26  688981.SH         -0.230134
3858347 2025-12-26  689009.SH         -0.477082

[3015996 rows x 3 columns]

## A191 Factor 109

Formula:

`SMA(HIGH-LOW,10,2)/SMA(SMA(HIGH-LOW,10,2),10,2)`

In [11]:
sql_alpha_109 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(high-low,10,2) / m_ta_ewm(m_ta_ewm(high-low,10,2),10,2) 
    AS alpha_a191_f0109
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_109), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0109
5067    2023-01-04  000001.SZ          1.000000
5068    2023-01-04  000002.SZ          1.000000
5069    2023-01-04  000004.SZ          1.000000
5070    2023-01-04  000005.SZ          1.000000
5071    2023-01-04  000006.SZ          1.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.930741
3858344 2025-12-26  688807.SH          0.996761
3858345 2025-12-26  688819.SH          0.956950
3858346 2025-12-26  688981.SH          1.005141
3858347 2025-12-26  689009.SH          1.034535

[3668729 rows x 3 columns]

## A191 Factor 110

Formula:

`SUM(MAX(0,HIGH-DELAY(CLOSE,1)),20)/SUM(MAX(0,DELAY(CLOSE,1)-LOW),20)*100`

In [12]:
sql_alpha_110 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(greatest(0,high-m_lag(close,1)),20) /
    m_sum(greatest(0,m_lag(close,1)-low),20) * 100 
    AS alpha_a191_f0110
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_110), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0110
101438  2023-02-07  000001.SZ        106.735751
101439  2023-02-07  000002.SZ         63.245033
101440  2023-02-07  000004.SZ        133.760684
101441  2023-02-07  000005.SZ         93.750000
101442  2023-02-07  000006.SZ         53.694581
...            ...        ...               ...
3858340 2025-12-26  688799.SH         97.164461
3858341 2025-12-26  688800.SH        159.325186
3858345 2025-12-26  688819.SH        135.840000
3858346 2025-12-26  688981.SH        142.827152
3858347 2025-12-26  689009.SH        100.141143

[3568164 rows x 3 columns]

## A191 Factor 111

Formula:

`SMA(VOL*((CLOSE-LOW)-(HIGH-CLOSE))/(HIGH-LOW),11,2)-SMA(VOL*((CLOSE-LOW)-(HIGH-CLOSE))/(HIGH-LOW),4,2)`

In [13]:
sql_alpha_111 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(volume*((close-low)-(high-close))/(high-low),11,2) -
    m_ta_ewm(volume*((close-low)-(high-close))/(high-low),4,2) 
    AS alpha_a191_f0111
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_111), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0111
5067    2023-01-04  000001.SZ      0.000000e+00
5068    2023-01-04  000002.SZ      0.000000e+00
5069    2023-01-04  000004.SZ      0.000000e+00
5070    2023-01-04  000005.SZ      0.000000e+00
5071    2023-01-04  000006.SZ      0.000000e+00
...            ...        ...               ...
3858343 2025-12-26  688805.SH      3.256066e+06
3858344 2025-12-26  688807.SH     -7.852306e+05
3858345 2025-12-26  688819.SH     -2.368145e+05
3858346 2025-12-26  688981.SH      1.031003e+07
3858347 2025-12-26  689009.SH      2.765483e+06

[3660817 rows x 3 columns]

## A191 Factor 112

Formula:

`(SUM((CLOSE-DELAY(CLOSE,1)>0?CLOSE-DELAY(CLOSE,1):0),12)-SUM((CLOSE-DELAY(CLOSE,1)<0?ABS(CLOSE-DELAY(CLOSE,1)):0),12))/(SUM((CLOSE-DELAY(CLOSE,1)>0?CLOSE-DELAY(CLOSE,1):0),12)+SUM((CLOSE-DELAY(CLOSE,1)<0?ABS(CLOSE-DELAY(CLOSE,1)):0),12))*100`

In [14]:
sql_alpha_112 = f"""--sql
SELECT
    date,
    instrument,
    ((m_sum(IF(close-m_lag(close,1)>0,close-m_lag(close,1),0),12) -
      m_sum(IF(close-m_lag(close,1)<0,abs(close-m_lag(close,1)),0),12)) /
     (m_sum(IF(close-m_lag(close,1)>0,close-m_lag(close,1),0),12) +
      m_sum(IF(close-m_lag(close,1)<0,abs(close-m_lag(close,1)),0),12))) * 100 
    AS alpha_a191_f0112
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_112), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0112
60821   2023-01-19  000001.SZ         44.000000
60822   2023-01-19  000002.SZ        -25.490196
60823   2023-01-19  000004.SZ         -7.792208
60824   2023-01-19  000005.SZ          5.882353
60825   2023-01-19  000006.SZ        -88.888889
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.886700
3858341 2025-12-26  688800.SH         -7.386532
3858345 2025-12-26  688819.SH         31.876138
3858346 2025-12-26  688981.SH         20.612318
3858347 2025-12-26  689009.SH        -12.200957

[3610510 rows x 3 columns]

## A191 Factor 113

Formula:

`(-1 * ((RANK((SUM(DELAY(CLOSE, 5), 20) / 20)) * CORR(CLOSE, VOLUME, 2)) *RANK(CORR(SUM(CLOSE, 5),SUM(CLOSE, 20), 2))))`

In [15]:
sql_alpha_113 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * ((c_pct_rank((m_sum(m_lag(close, 5), 20) / 20)) * m_corr(close, volume, 2)) *
           c_pct_rank(m_corr(m_sum(close, 5),m_sum(close, 20), 2)))) 
    AS alpha_a191_f0113
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_113), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0113
126857  2023-02-14  000001.SZ          0.948582
126858  2023-02-14  000002.SZ          0.230122
126859  2023-02-14  000004.SZ         -0.050239
126860  2023-02-14  000005.SZ         -0.007551
126861  2023-02-14  000006.SZ         -0.592517
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.305310
3858341 2025-12-26  688800.SH         -0.587091
3858345 2025-12-26  688819.SH         -0.335554
3858346 2025-12-26  688981.SH         -0.743960
3858347 2025-12-26  689009.SH          0.567178

[3446567 rows x 3 columns]

## A191 Factor 114

Formula:

`((RANK(DELAY(((HIGH -LOW) / (SUM(CLOSE, 5) / 5)), 2)) * RANK(RANK(VOLUME))) / (((HIGH -LOW) /(SUM(CLOSE, 5) / 5)) / (VWAP -CLOSE)))`

In [16]:
sql_alpha_114 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank(m_lag(((high -low) / (m_sum(close, 5) / 5)), 2)) *
      c_pct_rank(c_pct_rank(volume))) /
     (((high -low) /(m_sum(close, 5) / 5)) / (vwap -close))) 
    AS alpha_a191_f0114
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_114), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0114
35474   2023-01-12  000001.SZ     -74543.825426
35475   2023-01-12  000002.SZ     -24228.290073
35476   2023-01-12  000004.SZ        -17.713533
35477   2023-01-12  000005.SZ       -568.464365
35478   2023-01-12  000006.SZ      -3122.852513
...            ...        ...               ...
3858341 2025-12-26  688800.SH       -275.696500
3858342 2025-12-26  688802.SH          9.353758
3858345 2025-12-26  688819.SH         -2.575506
3858346 2025-12-26  688981.SH         10.352549
3858347 2025-12-26  689009.SH         -5.213070

[3629103 rows x 3 columns]

## A191 Factor 115

Formula:

`(RANK(CORR(((HIGH * 0.9) + (CLOSE * 0.1)), MEAN(VOLUME,30), 10))^RANK(CORR(TSRANK(((HIGH + LOW) /2), 4), TSRANK(VOLUME, 10), 7)))`

In [17]:
sql_alpha_115 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(((high * 0.9) + (close * 0.1)), m_avg(volume,30), 10))^
     c_pct_rank(m_corr(m_rank(((high + low) /2), 4), m_rank(volume, 10), 7))) 
    AS alpha_a191_f0115
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_115), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0115
198203  2023-03-06  000001.SZ          0.536358
198204  2023-03-06  000002.SZ          0.637261
198205  2023-03-06  000004.SZ          0.847987
198206  2023-03-06  000005.SZ          0.209600
198207  2023-03-06  000006.SZ          0.925754
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.646194
3858341 2025-12-26  688800.SH          0.887055
3858345 2025-12-26  688819.SH          0.840222
3858346 2025-12-26  688981.SH          0.780870
3858347 2025-12-26  689009.SH          0.940206

[3467725 rows x 3 columns]

## A191 Factor 116

Formula:

`REGBETA(CLOSE,SEQUENCE,20)`

In [18]:
sql_alpha_116 = f"""--sql
SELECT
    date,
    instrument,
    m_regr_slope(close,row_number(20),20) 
    AS alpha_a191_f0116
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_116), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0116
101438  2023-02-07  000001.SZ     -3.386909e-05
101439  2023-02-07  000002.SZ     -1.596724e-04
101440  2023-02-07  000004.SZ      3.359851e-06
101441  2023-02-07  000005.SZ     -2.463696e-07
101442  2023-02-07  000006.SZ     -4.020691e-06
...            ...        ...               ...
3858340 2025-12-26  688799.SH     -2.221019e-06
3858341 2025-12-26  688800.SH     -1.137453e-05
3858345 2025-12-26  688819.SH      1.388006e-06
3858346 2025-12-26  688981.SH      5.919460e-06
3858347 2025-12-26  689009.SH      9.464805e-07

[3568164 rows x 3 columns]

## A191 Factor 117

Formula:

`((TSRANK(VOLUME, 32) * (1 -TSRANK(((CLOSE + HIGH) -LOW), 16))) * (1 -TSRANK(RET, 32)))`

In [19]:
sql_alpha_117 = f"""--sql
SELECT
    date,
    instrument,
    ((m_rank(volume, 32) * (1 -m_rank(((close + high) -low), 16))) *
     (1 -m_rank(ret, 32))) 
    AS alpha_a191_f0117
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_117), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0117
162497  2023-02-23  000001.SZ            1260.0
162498  2023-02-23  000002.SZ             120.0
162499  2023-02-23  000004.SZ            4968.0
162500  2023-02-23  000005.SZ            1904.0
162501  2023-02-23  000006.SZ            1944.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH             700.0
3858341 2025-12-26  688800.SH            3388.0
3858345 2025-12-26  688819.SH            7020.0
3858346 2025-12-26  688981.SH            1728.0
3858347 2025-12-26  689009.SH             168.0

[3504709 rows x 3 columns]

## A191 Factor 118

Formula:

`SUM(HIGH-OPEN,20)/SUM(OPEN-LOW,20)*100`

In [20]:
sql_alpha_118 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(high-open,20)/m_sum(open-low,20)*100 
    AS alpha_a191_f0118
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_118), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0118
101438  2023-02-07  000001.SZ         83.297180
101439  2023-02-07  000002.SZ         75.657895
101440  2023-02-07  000004.SZ        104.150943
101441  2023-02-07  000005.SZ        137.142857
101442  2023-02-07  000006.SZ         68.932039
...            ...        ...               ...
3858340 2025-12-26  688799.SH         92.608696
3858341 2025-12-26  688800.SH        154.968519
3858345 2025-12-26  688819.SH        120.751880
3858346 2025-12-26  688981.SH        185.818651
3858347 2025-12-26  689009.SH         97.331461

[3567955 rows x 3 columns]

## A191 Factor 119

Formula:

`(RANK(DECAYLINEAR(CORR(VWAP, SUM(MEAN(VOLUME,5), 26), 5), 7)) -RANK(DECAYLINEAR(TSRANK(MIN(CORR(RANK(OPEN), RANK(MEAN(VOLUME,15)), 21), 9), 7), 8)))`

In [21]:
sql_alpha_119 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_decay_linear(m_corr(vwap, m_sum(m_avg(volume,5), 26), 5), 7)) -
     c_pct_rank(m_decay_linear(m_rank(m_min(m_corr(c_pct_rank(open), c_pct_rank(m_avg(volume,15)), 21), 9), 7), 8))) 
    AS alpha_a191_f0119
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_119), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0119
285216  2023-03-29  000001.SZ         -0.137684
285217  2023-03-29  000002.SZ         -0.154314
285218  2023-03-29  000004.SZ         -0.433938
285219  2023-03-29  000005.SZ          0.416701
285220  2023-03-29  000006.SZ          0.552536
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.218662
3858341 2025-12-26  688800.SH         -0.292677
3858345 2025-12-26  688819.SH          0.321937
3858346 2025-12-26  688981.SH         -0.471497
3858347 2025-12-26  689009.SH         -0.142280

[3378024 rows x 3 columns]

## A191 Factor 120

Formula:

`(RANK((VWAP -CLOSE)) / RANK((VWAP + CLOSE)))`

In [22]:
sql_alpha_120 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank((vwap -close)) / c_pct_rank((vwap + close))) 
    AS alpha_a191_f0120
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_120), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0120
5067    2023-01-04  000001.SZ          0.004514
5068    2023-01-04  000002.SZ          0.002455
5069    2023-01-04  000004.SZ          0.666803
5070    2023-01-04  000005.SZ          4.873267
5071    2023-01-04  000006.SZ          0.040078
...            ...        ...               ...
3858343 2025-12-26  688805.SH          1.413377
3858344 2025-12-26  688807.SH          1.043461
3858345 2025-12-26  688819.SH          1.395014
3858346 2025-12-26  688981.SH          1.092010
3858347 2025-12-26  689009.SH          1.129141

[3668803 rows x 3 columns]